python/DBSAPI_v1/DBS.insertEventCollections.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:DBS="http://tempuri.org/DBS.xsd">
 <SOAP-ENV:Body>
  <DBS:insertEventCollections>
   <eventCollectionList>
    <collectionId>0</collectionId>
    <collectionIndex>0</collectionIndex>
    <numberOfEvents>0</numberOfEvents>
    <status></status>
    <collectionName></collectionName>
    <datasetPathName></datasetPathName>
    <parent>
     <collectionId>0</collectionId>
     <collectionIndex>0</collectionIndex>
     <numberOfEvents>0</numberOfEvents>
     <status></status>
     <collectionName></collectionName>
     <datasetPathName></datasetPathName>
     <parent>
      <collectionId>0</collectionId>
      <collectionIndex>0</collectionIndex>
      <numberOfEvents>0</numberOfEvents>
      <status></status>
      <collectionName></collectionName>
      <datasetPathName></datasetPathName>
      <parent>
       <collectionId>0</collectionId>
       <collectionIndex>0</collectionIndex>
       <numberOfEvents>0</numberOfEvents>
       <status></status>
       <collectionName></collectionName>
       <datasetPathName></datasetPathName>
       <parent>
        <collectionId>0</collectionId>
        <collectionIndex>0</collectionIndex>
        <numberOfEvents>0</numberOfEvents>
        <status></status>
        <collectionName></collectionName>
        <datasetPathName></datasetPathName>
        <parent>
         <collectionId>0</collectionId>
         <collectionIndex>0</collectionIndex>
         <numberOfEvents>0</numberOfEvents>
         <status></status>
         <collectionName></collectionName>
         <datasetPathName></datasetPathName>
         <parent>
          <collectionId xsi:nil="true"></collectionId>
          <collectionIndex xsi:nil="true"></collectionIndex>
          <numberOfEvents xsi:nil="true"></numberOfEvents>
          <status></status>
          <collectionName></collectionName>
          <datasetPathName></datasetPathName>
          <parent xsi:nil="true"></parent>
          <parentageType></parentageType>
          <fileList></fileList>
         </parent>
         <parentageType></parentageType>
         <fileList>
          <id xsi:nil="true"></id>
          <guid></guid>
          <logicalFileName></logicalFileName>
          <checksum></checksum>
          <fileSize xsi:nil="true"></fileSize>
          <fileStatus></fileStatus>
          <fileType></fileType>
          <fileBlockId xsi:nil="true"></fileBlockId>
         </fileList>
        </parent>
        <parentageType></parentageType>
        <fileList>
         <id>0</id>
         <guid></guid>
         <logicalFileName></logicalFileName>
         <checksum></checksum>
         <fileSize>0</fileSize>
         <fileStatus></fileStatus>
         <fileType></fileType>
         <fileBlockId>0</fileBlockId>
        </fileList>
       </parent>
       <parentageType></parentageType>
       <fileList>
        <id>0</id>
        <guid></guid>
        <logicalFileName></logicalFileName>
        <checksum></checksum>
        <fileSize>0</fileSize>
        <fileStatus></fileStatus>
        <fileType></fileType>
        <fileBlockId>0</fileBlockId>
       </fileList>
      </parent>
      <parentageType></parentageType>
      <fileList>
       <id>0</id>
       <guid></guid>
       <logicalFileName></logicalFileName>
       <checksum></checksum>
       <fileSize>0</fileSize>
       <fileStatus></fileStatus>
       <fileType></fileType>
       <fileBlockId>0</fileBlockId>
      </fileList>
     </parent>
     <parentageType></parentageType>
     <fileList>
      <id>0</id>
      <guid></guid>
      <logicalFileName></logicalFileName>
      <checksum></checksum>
      <fileSize>0</fileSize>
      <fileStatus></fileStatus>
      <fileType></fileType>
      <fileBlockId>0</fileBlockId>
     </fileList>
    </parent>
    <parentageType></parentageType>
    <fileList>
     <id>0</id>
     <guid></guid>
     <logicalFileName></logicalFileName>
     <checksum></checksum>
     <fileSize>0</fileSize>
     <fileStatus></fileStatus>
     <fileType></fileType>
     <fileBlockId>0</fileBlockId>
    </fileList>
   </eventCollectionList>
  </DBS:insertEventCollections>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
