Clients/PythonAPI/DBS.createProcessedDataset.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:DBS="http://tempuri.org/DBS.xsd">
 <SOAP-ENV:Body>
  <DBS:createProcessedDataset>
   <processedDataset>
    <id>0</id>
    <processedDatasetName></processedDatasetName>
    <primaryDatasetName></primaryDatasetName>
    <processingPath>
     <pathId>0</pathId>
     <parent></parent>
     <application>
      <applicationId>0</applicationId>
      <executable></executable>
      <version></version>
      <family></family>
      <parameterSet></parameterSet>
     </application>
     <dataTier></dataTier>
    </processingPath>
    <isDatasetOpen>0</isDatasetOpen>
   </processedDataset>
  </DBS:createProcessedDataset>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
